#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.resources.module.eks.data.aws_partition.current: Reading...
module.resources.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.data.aws_db_instance.zeno-db: Reading...
module.resources.data.aws_availability_zones.available: Reading...
module.resources.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.resources.data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.resources.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0233b677bf7586002]
module.resources.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/zeno-staging-cluster/cluster]
module.resources.aws_db_parameter_group.eoapi_postgres17: Refreshing state... [id=eoapi-postgres17-staging]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.resources.module.eks.data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_partition.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.resources.data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.aws_iam_role.this[0]: Refreshing state... [id=zeno-staging-cluster-cluster-20250423104012446600000002]
module.resources.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role.this[0]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001]
module.resources.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=084375562450]
module.resources.module.eks.data.aws_iam_session_context.current: Reading...
module.resources.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::084375562450:user/tarashish@developmentseed.org]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.resources.data.aws_db_instance.zeno-db: Read complete after 0s [id=zeno-db]
module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=zeno-staging-cluster-cluster-20250423104012446600000002-20250423104013141400000006]
module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=zeno-staging-cluster-cluster-20250423104012446600000002-20250423104013137000000004]
module.resources.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.resources.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4106847354]
module.resources.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=9e945bfa-7af5-4c7a-aeea-c903ae9d7ceb]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001-2025042310401330780000000a]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003-20250423104013140300000005]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001-2025042310401343260000000d]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003-20250423104013254500000007]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003-20250423104013264000000008]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003-20250423104013267500000009]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001-2025042310401341840000000c]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001-2025042310401331080000000b]
module.resources.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/zeno-staging-cluster]
module.resources.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::084375562450:policy/zeno-staging-cluster-cluster-ClusterEncryption20250423104036435700000013]
module.resources.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-080c4a3dcb3b8052b]
module.resources.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-041ed5a76f985e613]
module.resources.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0537c1494dcb98da7]
module.resources.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0506d1fa3dd14a30d]
module.resources.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0b489d24e0ce75357]
module.resources.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ed8b0636d7d94689]
module.resources.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-04591b309ac62bf35]
module.resources.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06be7fcbfc68758ff]
module.resources.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f1544432f2a769d2]
module.resources.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0426fdcf27ef3a6cf]
module.resources.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-093dc828845e30d17]
module.resources.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06a71eea1358f008f]
module.resources.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-061f3f293ed2f3f5e]
module.resources.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0aab8f574f4bd33a2]
module.resources.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=zeno-staging-cluster-cluster-20250423104012446600000002-20250423104036893800000014]
module.resources.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-094f6a6e2662b1bb8]
module.resources.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0506d1fa3dd14a30d1080289494]
module.resources.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f2dc967bed79f4f8]
module.resources.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09bbbde80e6fb511a]
module.resources.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0276ddde804e58cfc]
module.resources.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02d43da8b8a59983d]
module.resources.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-045eb5766c52522d3]
module.resources.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0cb15b3621112dd16]
module.resources.aws_db_subnet_group.eoapi: Refreshing state... [id=eoapi-staging]
module.resources.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3009130306]
module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4101756891]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2054856278]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-547016993]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3006855616]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3301307946]
module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1344566324]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1191288840]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2690958817]
module.resources.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2933540329]
module.resources.aws_security_group.eoapi_db: Refreshing state... [id=sg-05baefd9f9f1b7cd0]
module.resources.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-400054497]
module.resources.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e709e9a614ca4982]
module.resources.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0b489d24e0ce753571080289494]
module.resources.aws_db_instance.eoapi: Refreshing state... [id=db-WJHTOX5LXUFRSOJXHKSED2VDLA]
module.resources.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=zeno-staging-cluster]
module.resources.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.resources.module.eks.data.tls_certificate.this[0]: Reading...
module.resources.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-04-23T10:49:53Z]
module.resources.module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=4739490560680664532]
module.resources.module.eks.module.eks_managed_node_group["regular"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=7317963306366209068]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-060c1341fd5085052]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_launch_template.this[0]: Refreshing state... [id=lt-0f1c85b0fbe9c202f]
module.resources.kubernetes_secret.eoapi_db_credentials: Refreshing state... [id=eoapi/eoapi-db-credentials]
module.resources.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.resources.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::084375562450:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/95005FA9F13DD1BDD5BBF6502423AC04]
module.resources.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=zeno-staging-cluster:default-2025042310495965280000001b]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_eks_node_group.this[0]: Refreshing state... [id=zeno-staging-cluster:regular-20250423104959652800000019]
module.resources.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=zeno-staging-cluster:aws-ebs-csi-driver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.resources.aws_iam_access_key.langfuse will be created
  + resource "aws_iam_access_key" "langfuse" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "langfuse-staging-s3-user"
    }

  # module.resources.aws_iam_user.langfuse will be created
  + resource "aws_iam_user" "langfuse" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "langfuse-staging-s3-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.resources.aws_iam_user_policy.langfuse will be created
  + resource "aws_iam_user_policy" "langfuse" {
      + id          = (known after apply)
      + name        = "langfuse-staging-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + user        = "langfuse-staging-s3-user"
    }

  # module.resources.aws_s3_bucket.langfuse will be created
  + resource "aws_s3_bucket" "langfuse" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "langfuse-staging-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @batpad, Action: `pull_request`*